# GetStraightsThatWereNotChanged Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationNetworkChangeService..::..GetStraightsThatWereNotChanged Method
FabricationNetworkChangeService Class See Also
---
Gets the set of fabrication part straights that were not changed due to either there was no corresponding part in the service or the size was out of range.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public ISet<ElementId> GetStraightsThatWereNotChanged()
```

Visual Basic
---
```text
Public Function GetStraightsThatWereNotChanged As ISet(Of ElementId)
```

Visual C++
---
```text
public:
ISet<ElementId^>^ GetStraightsThatWereNotChanged()
```

# Remarks
This set of element identifiers is only available after the **ChangeService** or **ChangeSize** method has been invoked, and returns FabricationNetworkChangeServiceResult::Enum::PartialFailure.
# See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace